Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ནས་ གོ་ཆ་ འཚལ་ སྙམ་ ནས །_།
en: So I wish to request the armor.

source: བདག་ ལ་ ཀུན་ ཏུ་ འདུན་ སྐྱེས་པ ས །_། བདག་ ཀྱང་ དེ་ འདྲ ར་ འགྱུར་ སྙམ་ བགྱིད །_།
en: The inspiration thus born in me Compels me to think, may I too become like him!

source: སྤྱན་ལྡན་ ཆོས་ ཀྱི་ སྦྱིན་པ་ ཡིས །_། སེམས་ཅན་ ཐམས་ཅད་ མགྲོན་ དུ་ གཉེར །_།
en: $1629 “Seer, through the gift of Dharma I will invite all beings as guests.

source: ཁྱུ་མཆོག་ གི་ ནི་ ཚིག་ ཏུ་ སྨྲ །_།
en: I will speak in the words of the best of men.

source: གཞན་ དུ་མ་ ལགས་ དེ་བཞིན་ བགྱི །_།
en: I will do just that and nothing else.

source: འདྲེན་པ་ སླད་ ཀྱིས་ སྡུམ་པ ར་ ནི །_། བདག་ གི་ འདུན་པ ར་ འཇུག་མ་ ལགས །_།
en: $1630 “Guide, it is my aspiration Henceforth to enter no household.

source: འཇིག་རྟེན་ མགོན་པོ འི་ བསྟན་པ་ དེ །_། |#| འདི་ཉིད་ ལ་ ནི་ རབ་ཏུ་ འབྱུང་ །_།
en: I will go forth precisely in this: |#| The teaching of the world’s protector.

source: མངོན་པར་ འབྱུང་ དང་ བརྩོན་འགྲུས་ དང་ །_། ཡོན་ཏན་ རྣམས་ དང་ བསམ་ [197a] གཏན་ དང་ །_། ཏིང་འཛིན་ ཤེས་རབ་ འབྲས་ དེ་ ལགས །_།
en: $1631 “That is the fruition of renunciation, diligence, Virtuous qualities, concentration, [197.a] Absorption, and insight—

source: དེ་ཉིད་ བདག་ གིས་ བསྟེན་པ ར་ བགྱི །_།
en: I will rely precisely upon those.

source: སྤྱན་ལྡན་ དག་ ལ་ འདུན་པ་ སྐྱེས །_།
en: $1632 “I am inspired by the seers—

source: མྱུར་ དུ་ བདག་ ནི་ རབ་ཏུ་ ཕྱུང་ །_།
en: Allow me to go forth instantly!

source: ངུར་སྨྲིག་ གོས་ ནི་ འཚལ་ ནས་ སུ །_།
en: Having pursued the ochre robes,

source: ཆོས་ ཀྱི་ དམ་པ་ སྤྱད་པ ར་ བགྱི །_།
en: I will practice the most sublime of Dharmas.

source: མེ་ལོང་ ཡེ་ཤེས་ ལྟ་ བུ ས་ ཀྱང་ །_། འཇིག་རྟེན་ དེ་ ལ་ རྣམ་ སེམས་ ཤིང་ །_། འཇིག་རྟེན་ མཆོག་ ཏུ་ འགྱུར་བ ར་ བགྱི །_།
en: $1633 “With mirror-like wisdom I will reflect upon the world, And become supreme in the world—

source: ལེགས་པ ར་ རབ་ཏུ་ དབྱུང་ དུ་ གསོལ །_།
en: I beseech you to fully send me forth!

source: ཐམས་ཅད་ ཀྱང་ ནི་ མ་ མཆིས་པ ས །_། སེམས་ཅན་ འདུ་ཤེས་ མི་ གནས་ ཤིང་ །_།
en: $1634 “Since nothing at all exists, I will not dwell on the notion of beings, And

source: བདག་ མངོན་ རྫོགས་པ ར་ སངས་རྒྱས་ ནས །_།
en: having thus manifestly and fully awakened,

source: འདྲེན་པ་ ཆོས་ དེ་ བསྟན་པ ར་ བགྱི །_།
en: Guide, I will teach the Dharma!

source: བདུད་དཔུང་ བཅས་པ་ བཅོམ་ ནས་ སུ །_།
en: $1635 “Having destroyed Māra and his hordes,

source: མུ་སྟེགས་ གཞན་ རྣམས་ སྐྲག་ བགྱིས་ ཏེ །_།
en: I will frighten all other non-Buddhists;

source: ལྟ་བ འི་ དྲ་བ་ རབ་ བཅོམ་ ནས །_།
en: Having destroyed the web of beliefs,

source: སྲོག་ཆགས་ རྣམས་ ཀྱི་ དོན་ བགྱི འོ །_།
en: I will work for the welfare of beings.

source: མྱ་ངན་ འདས་ བདེ་ འཐོབ་ སླད་ དུ །_། བདག་ གིས་ ལམ་ ནི་ བསྟན་པ ར་ བགྱི །_།
en: $1636 “For them to attain the bliss of nirvāṇa I will teach the path.

source: དེ་ ལ་ སྐྱེ་བ་ མ་ མཆིས་ པ ས །_། ལམ་ དེ་ བསམ་ མི་ ཁྱབ་པ་ ལགས །_།
en: Since it is devoid of arising, The path is inconceivable.

source: བདག་ གིས་ དྲ་བ་ རྣམ་ ཕྱེ་ ནས །_།
en: $1637 “Once I have unfolded the net of light,

source: བདག་ གིས་ ཆོས་ ཀྱི་ སྣང་བར་ བགྱི །_།
en: I shall let the Dharma shine.

source: རང་བཞིན་ དེ་ དང་ མཚན་ཉིད་ དེ འི །_། ཆོས་ ནི་ ཇི་ལྟ་ བཞིན་ དུ་ བསྟན །_།
en: I will teach the Dharma, exactly as it is, In terms of its nature and character.

source: རྫུ་འཕྲུལ་ སྟོབས་ ཀྱིས་ རྣམ་འཕྲུལ་ བགྱི །_།
en: $1638 “I will perform miracles through my supernatural power;

source: ཆོ་འཕྲུལ་ དག་ ནི་ བསྟན་པ ར་ བགྱི །_།
en: I will demonstrate miraculous feats.

source: དེ་ ལ་ གང་ དག་ བདག་ ལ་ ལྟ །_། ཀུན་ གྱི་ ཐེ་ཚོམ་ འཆད་པ ར་ འགྱུར །_།
en: I will resolve the doubts of everyone Who believes in a self.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $1639 The Blessed One then asked Vijayarakṣa,

source: ཁྱེའུ་ ང འི་ བསྟན་པ་ འདི་ ལ་ ཁྱིམ་ ནས་ ཁྱིམ་ མེད་པར་ རབ་ཏུ་ འབྱུང་བ ར་ འདོད་ དམ །_།
en: “Child, do you want to go forth from home to homelessness under this teaching of mine?”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ །_།
en: $1640 The Blessed One said:

source: གང་ཞིག་ ངུར་སྨྲིག་ མི་ འཛིན་ ཅིང་ །_། གང་དག་ སྙིགས་མ་ མེད་ གྱུར་པ །_། ང་ ཡི་ བསྟན་ ལ་ རབ་ འབྱུང་བ ར །_། བྱ་བ འི་ ཆོས་ ནི་ དེ་ ཡིན་ ནོ །_།
en: “It is for those who do not already wear ochre robes, And whoever has no impurity— Those are the things to be accomplished, To go forth under my teaching.

source: གང་ གི་ སྐྲ་ དག་མ་ བྲེགས་ ཤིང་ །_། བཅིང་བ་ ཐམས་ཅད་ བཅད་ གྱུར་ ལ །_། མ་ བཅིངས་ པ་ དང་ མ་ གྲོལ་བ །_། འདི་ ལ་ རབ་ཏུ་ བྱུང་བ་ དེ འོ །_།
en: $1641 “Whoever’s hair is unshaven, And has severed all bonds, But is neither bound, nor free, Goes forth under this.

source: གང་དག་ བསླབ་ ལ་ མི་སློབ་པ །_། བསླབ་པ འང་ འབོགས་པ ར་ བྱེད་ མ་ ཡིན །_། |#| བསླབ་པ་ ཀུན་ ལ་ བསླབས་པ་ ནི །_། འདི་ ལ་ རབ་ཏུ་ བྱུང་བ་ དེ འོ །_།
en: $1642 “Whoever neither trains in the trainings, Nor confers the trainings, But has trained in all trainings Goes forth under this.

source: !གང་ཞིག་ དམ་ཆོས་ མི་ འཛིན་ ཅིང་ །_། ཆོས་ རྣམས་ ཐམས་ཅད་ རྣམ་ བསྒོམས་ ལ །_། ཆོས་ ཀྱི་ [197b] འདུ་ཤེས་ བསྩལ་ གྱུར་པ །_། དེ་ ནི་ འདི་ ལ་ རབ་ཏུ་ བྱུང་ །_།
en: $1643 “Whoever does not cling to the sublime Dharma, Yet cultivates all Dharma teachings, [197.b] While having removed#78 the notion of Dharma, Goes forth under this.

source: གང་ཞིག་ བདག་ ཅེས་ མི་ སེམས་ ཤིང་ །_། གང་ཞིག་ སེམས་ཅན་ ཞེས་ མི་ སེམས །_། དེ་ ལ་ ཞུམ་པ་ ཉིད་ མི་ འབྱུང་ །_། |#| དེ་ ནི་ བྱང་ཆུབ་ ཕྱིར་ ཞུགས་པ འོ །_།
en: $1644 “Whoever does not imagine ‘I,’ Does not imagine ‘being,’ And does not feel apprehensive Has set out for awakening.

source: གང་ གིས་ སེམས་ ནི་ བསྐྱེད་ གྱུར་ ལ །_། ཆོས་ གཞན་ ཡང་ ནི་ མི་ དམིགས་ ཤིང་ །_། སེམས་ ལ་ འཛིན་པ ར་ མི་ བྱེད་པ །_། དེ་ ནི་ ང་ ལ་ རབ་ཏུ་ བྱུང་ །།_།།
en: $1645 “Whoever has given rise to the mind of awakening, Does not focus on any other phenomena, And does not cling to mind Goes forth under me.”

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: $1646 The venerable Śāradvatī­putra then thought,

source: གང་ བཅོམ་ལྡན་འདས་ ཀྱིས་ གནས་ ཟབ་མོ་ ཟབ་མོ་ དག་ བསྟན་པ འི་ ཁྱེའུ་ དེས་ ཡུན་ ཅི་ སྲིད་ ཅིག་ སྤྱད་པ ར་ འགྱུར་ སྙམ་ མོ །_།
en: “How long has that child, to whom the Blessed One has just taught profound points, practiced them?”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུས་ ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ གསོལ་པ །_
en: The venerable Śāradvatī­putra therefore spoke these verses to the Blessed One:

source: བཅོམ་ལྡན་ ཟབ་མོ འི་ ཆོས་ ཐོས་ ནས །_། |#| མི་ སྐྲག་ ཞུམ་པ ར་ མི་འགྱུར་བ འི །_། ཁྱེའུ་ ནི་ རྣམ་པར་ རྒྱལ་སྲུང་ གི །_། སྤྱོད་པ་ དེ་ འདྲ་ དེ་ ཅི་ ལགས །_།
en: $1647 “Blessed One, what kind of practice Does the child Vijayarakṣa possess, Who is neither frightened nor timid Upon hearing the profound Dharma?

source: གང་ གིས་ ཟབ་ མོ འི་ གནས་ ཐོས་ ནས །_། |#| དེ་ ལ་ སྐྲག་པ་ མི་ འབྱུང་བ །_། སྔོན་ཆད་ སྐྱེ་བ་ གཞན་དག་ ཏུ །_། རྫོགས་པ འི་ སངས་རྒྱས་ ཇི་སྙེད་ མཐོང་ །_།
en: $1648 “One who has no fear Upon hearing profound points Has in other lifetimes before Seen myriad perfect buddhas.

source: གང་ གིས་ སྒྱིད་ལུག་ མི་འགྱུར་བ །_། གནས་ རྣམས་ ཀྱང་ ནི་ ཟབ་མོ་ དག _། |#| སྔོན་ གྱི་ སངས་རྒྱས་ རྐང་ གཉིས་ མཆོག _། ཇི་སྙེད་ ཅིག་ ལ་ ཞུས་པ་ ལགས །_།
en: $1649 “Undiscouraged By profound points, He has inquired about them Before myriad previous buddhas, the best of humans.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སླར་ བཀའ་ སྩལ་པ །_
en: $1650 The Blessed One then answered the venerable Śāradvatī­putra with these verses:

source: འདས་པ འི་ དུས་ ན་ ངས་ ཤེས་པ །_། ས་ ཡི་ ཕྱོགས་ ནི་ འདི་ཉིད་ དུ །_། སངས་རྒྱས་ སྟོང་ཕྲག་ མང་པོ་ ལ །_། རྣམ་པར་ རྒྱལ་བ་ སྲུང་ གིས་ ཞུས །_།
en: “I know that in the past, At this very place, Vijayarakṣa posed questions To many thousands of buddhas.

source: ཨང་ ག་ མ་ ག་ དྷཱ་ དེར་ ནི །_། བྱང་ཆུབ་ སྤྱད་པ་ སྤྱོད་པ་ ན །_།
en: While he was practicing the conduct of awakening, In Aṅga of Magadha.

source: གང་དག་ ལ་ ནི་ སྔོན་ ཞུས་པ །_། སངས་རྒྱས་ ཇི་སྙེད་པ་ ཡང་ ཤེས །_།
en: $1651 “He knew all the buddhas Who were queried in the past,

source: ཆོས་ རྣམས་ དང་ ནི་ ཁམས་ རྣམས་ དང་ །_། སྐྱེ་མཆེད་ དག་ དང་ སྟོང་པ་ དང་ །_། ཚད་ མེད་ དེ་ དང་ རྣམ་ཐར་ གྱི །_། གནས་ དང་ གནས་མིན་ རབ་ཏུ་ མཁས །_།
en: $1652 “He became fully adept in the sound and unsound positions Regarding phenomena, the elements, The sense sources, emptiness, The immeasurables, and the liberations.

source: ཇི་ལྟ ར་ ཨང་ ག་ མ་ ག་ དྷཱར །_། ཨེ་མ་ སངས་རྒྱས་ ཤེས་པ་ བཞིན །_། དེ་ལྟ ར་ ཀ་ ཤི འི་ ཁྱིམ་ རྣམས་ སུ །_། མཁས་པ ས་ དེ་སྙེད་ ཤེས་པ་ ཡིན །_།
en: $1653 “Ah, just as he knew the buddhas In Aṅga of Magadha, So too, through the scholars in the houses in Kāśi, Did he know all of them there.

source: རྣམ་པར་ རྒྱལ་སྲུང་ ཁྱེའུ་ དེ་ ནི །_། ཤེས་རབ་ ཕ་རོལ་ ཕྱིན་པ་ ཐོབ །_།
en: $1654 “The child Vijayarakṣa Has attained the perfection of insight.

source: དཀར་ཆོས་ རྣམས་ ཀྱིས་ བྱུང་བ་ ཡིན །_།
en: He is born from wholesome qualities.

source: དེ་ཕྱིར་ དེ་ ཤེས་ དེ་ འདྲ་བ །_།
en: Therefore, he has such knowledge.

source: འདིར་ ནི་ ཆོས་ ལ་ རེག་པ ར་ བྱེད །_།
en: $1655 “It has put him in touch with the Dharma here. [198.a]

source: [198a] ཡི་གེ་ ཇི་བཞིན་ ཕྱག་རྒྱ་ གྲངས །_།
en: He counts the seals according to the letter.#79

source: བཟོ་ རྣམས་ སྣ་ཚོགས་ གཞན་ ཡང་ ཤེས །_། |#| དེ་ལས་ གཞན་ ཡང་ བརྗེད་པ་ མེད །_།
en: He also knows the various other arts, And does not forget anything else.

source: ཆོས་ རྣམས་ ཐམས་ཅད་ སྟོང་པ་ཉིད །_། འཇིག་རྟེན་ འདས་པ འི་ ཤེས་ ལས་ གཞན །_། འཇིག་རྟེན་པ་ ཡི་ ཤེས་ མི་སྨྲ །_། དེ་ ལ་ མཆོག་ ཏུ་ འཛིན་ མི་ བྱེད །_།
en: $1656 “Aside from the supramundane knowledge That all phenomena are emptiness, He does not speak of mundane knowledge, Nor cling to it as supreme.

source: གང་ གིས་ ཡེ་ཤེས་ དེ་ འདྲ་ དང་ །_། ཆོས་ རྣམས་ ཐམས་ཅད་ སྟོང་པ་ཉིད །_། དེ་ ལ་ བསྐལ་པ་ བརྒྱ་ དག་ ཏུའང་ །_། རྨོངས་པ་ ཡོད་པ་ མ་ ཡིན་ ནོ །_།
en: $1657 “With such wisdom He has not been deluded For hundreds of eons About the fact that all phenomena are emptiness.

source: ཡེ་ཤེས་ དེ་ ནི་ ཡེ་ཤེས་ ཆེ །_། |#| ཉོན་མོངས་ ཟད་ བྱེད་ རང་བཞིན་ ཅན །_།
en: $1658 “That wisdom is great wisdom, Whose nature brings an end to afflictions.

source: གང་ཞིག་ སྟོང་པ་ མི་འདོད་པ །_། དེ་ ནི་ ཆོས་ ལ་ འཇུག་ མི་ འགྱུར །_།
en: Whoever does not want emptiness, Will not enter the Dharma.”

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུས་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: $1659 The venerable Śāradvatī­putra then said to the child Vijayarakṣa,

source: གཞོན་ནུ་ ཁྱོད་ བཅོམ་ལྡན་འདས་ ཀྱི་ བསྟན་པ་ ལ་ རབ་ཏུ་ འབྱུང་ ངམ །_
en: “Boy, will you go forth under the Thus-Gone One’s teaching?”

source: ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ ལ་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་ བ ས་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: Vijayarakṣa responded to the venerable Śāradvatī­putra,

source: བཙུན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ བདག་ ནི་ རབ་ཏུ་ བྱུང་ ཟིན་པ ས་ བདག་ རབ་ཏུ་ མི་ འབྱུང་ ངོ་ །_།
en: “Venerable Śāradvatī­putra, since I have already gone forth, I will not go forth.”

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུས་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སྨྲས་པ །_
en: $1660 The venerable Śāradvatī­putra then spoke these verses to the child Vijayarakṣa:

source: ཁྱོད་ ཀྱིས་ གོས་ དག་ གང་ བགོས་པ །_། ངུར་སྨྲིག་ ཁྱོད་ ལ་ གནང་ མ་ ཡིན །_།
en: “What garments have you donned? |#| You were not given ochre.

source: ཁྱོད་ ཀྱི་ སྐྲ་ ཡང་ བྲེགས་ མ་ ཡིན །_།
en: Nor has your hair been shaven.

source: འདི་ ལ་ ཇི་ལྟ ར་ རབ་ཏུ་ བྱུང་ །_།
en: How could you have gone forth?

source: ཁྱོད་ ཀྱིས་ བསླབ་ ལ་ བསླབས་ མ་ ཡིན །_།
en: $1661 “You have not trained in the trainings.

source: ཁྱོད་ ལ་ སློབ་དཔོན་ ཡོད་ མ་ ཡིན །_། |#| མཁན་པོ་ ཡང་ ནི་ ཡོད་ མ་ ཡིན །_།
en: You have no teacher, Nor a preceptor.

source: ཁྱོད་ ནི་ ཇི་ལྟ ར་ རབ་ཏུ་ བྱུང་ །_།
en: How could you have gone forth?

source: ཁྱོད་ ནི་ ལྷུང་བཟེད་ ཐོགས་ མ་ ཡིན །_།
en: $1662 “You do not carry an alms bowl.

source: ཁྱོད་ ནི་ མཚམས་ སུ་ བྱུང་བ་ ཡིན །_།
en: You have come during retreat.

source: འདི་ ལ་ གང་ གིས་ རབ་བྱུང་བ །_།
en: What makes you gone forth?

source: ཁྱོད་ ནི་ ཇི་ལྟ ར་ བསྡམས་པ་ ཡིན །_།
en: How are you restrained?

source: གང་ དུ་ ཚོགས་ ཀྱིས་ རྫོགས་པ ར་ བྱས །_།
en: $1663 “Where did you go forth with an assembly?

source: ཁྱོད་ ཀྱི་ དེ་སྙེད་ སུ་ ཡིས་ བྱས །_།
en: Who allowed all this for you?

source: བདག་ གིས་ དྲིས་པ་ དེ་ སྨྲོས་ ཤིག _།
en: Answer these questions!”

source: ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ ལ་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ ས་ ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ སླར་ སྨྲས་པ །_།
en: $1664 The child Vijayarakṣa answered the venerable Śāradvatī­putra with these verses:

source: གང་ཞིག་ ངུར་སྨྲིག་ འཛིན་བྱེད་པ །_། སྙིགས་མ་ མེད་པ་ འཛིན་ མི་ བྱེད །_། |#| མ་ སྐྱེས་པ་ ཡང་ འཛིན་པ་ མེད །_། |#| ངུར་སྨྲིག་ གྱོན་པ་ དེ་ ཡིན་ ནོ །_།
en: “Whoever grasps ochre Without impurity and without clinging to it, And without clinging even to non-arising, Is wearing ochre.

source: ཡེ་ཤེས་ གོས་ ནི་ བདག་ གིས་ བཟུང་ །_།
en: $1665 “I have grasped the robe of wisdom;

source: དེ་ ནི་ ནམ་ [198b] ཡང་ གོས་པ་ མེད །_།
en: [198.b] It is never stained.

source: རྟག་ ཏུའང་ དྲི་མེད་ རྣམ་དག་པ འི །_། ངུར་སྨྲིག་ བདག་ གིས་ གྱོན་པ་ ཡིན །_།
en: I wear the ochre That is perpetually stainless and pristine.

source: བདག་ གིས་ ཉོན་མོངས་ ཐམས་ཅད་ སྤངས །_།
en: $1666 “I have abandoned all afflictions—

source: བདག་ གིས་ སྐྲ་ དག་ བྲེག་པ་ བྱས །_།
en: Thus have I shaven my hair.

source: ཡེ་ཤེས་ ཀྱིས་ ནི་ བདག་ གིས་ བྲེགས །_།
en: I have shaven it with wisdom;

source: དེ་དག་ ཕྱིན་ ཅད་ སྐྱེ་ མི་ འགྱུར །_།
en: It will not grow back again.

source: ལྷུང་བཟེད་ བསམ་ མི་ ཁྱབ་ ལས་ བྱུང་ །_།
en: $1667 “The alms bowl comes from the inconceivable.

source: ཆོས་ རྣམས་ ཀུན་ གྱི་ སྣོད་ ཡིན་ ཏེ །_།
en: It is the vessel of all qualities—

source: གང་བ་ མེད་ ཅིང་ བྲི་ མེད་ དེ །_།
en: Neither filled nor depleted,

source: ཆོས་ རྣམས་ ཀུན་ གྱི་ སྣོད་ ཡིན་ ནོ །_།
en: It is the vessel of all qualities.

source: བདག་ ནི་ གཞན་ གྱི་ མན་ངག་ ལ །_། ནམ་ཡང་ གནས་ ཤིང་གནས་ འགྱུར་མེད །_།
en: $1668 “I never have, nor will I Adhere to the precepts of others.

source: ཐམས་ཅད་ མཁྱེན་ ཅིང་ རང་ འབྱུང་འགྱུར །_།
en: I will be all-knowing and self-arisen—

source: བདག་ གི་ ཕུན་སུམ་ ཚོགས་ དེ་ ཡིན །_།
en: That is my excellence.

source: ཆོས་ ཀུན་ མཉམ་ མཛད་ སངས་རྒྱས་ ཀྱིས །_། བདག་ ལ་ གསོལ་བ་ མཛད་ ཟིན་ ཏེ །_།
en: $1669 “The buddhas who equalize all phenomena Have spoken to me.

source: འདྲེན་ རྣམས་ གང་ ནས་ གཤེགས་པ་ ཡི །_། སངས་རྒྱས་ ལམ་ ནས་ འགྲོ་བ ར་ བྱ །_།
en: I will traverse the path to awakening, Where the guides too have traveled.

source: བདག་ གི་ རང་བྱུང་ དེ་ འདྲ་ སྟེ །_།
en: $1670 “My self-arising is thus, And

source: བདག་ གི་ བསླབ་པ་ དེ་ འདྲ་ ཡིན །_།
en: my training is also thus.

source: མྱ་ངན་ འདས་པ འང་ དེ་ འདྲ་ སྟེ །_།
en: Nirvāṇa is also like that, And

source: གསོལ་ བ འི་ ལས་ ནི་ དེ་ འདྲ་ ཡིན །_།
en: the act of speaking is the same.

source: སྤྱོད་པ་ ལ་ ནི་ དེ་རིང་ བསླབས །_།
en: $1671 “I have trained today in conduct.

source: ནམ་ཞིག་ འཇིག་རྟེན་ མགོན་ ཐད་ དུ །_། ཞིང་ ནས་ཞིང་ དུ་ འགྲོ་བ་ དག _། |#| བདག་ གིས་ ཀྱང་ ནི་ སྤྱད་པ ར་ བྱ །_།
en: At some point I will also Travel from field to field In pursuit of the savior of the world.

source: བྱང་ཆུབ་ སྙིང་པོ ར་ འདུག་ ནས་ སུ །_།
en: $1672 “Seated at the seat of awakening,

source: སྦྱིན་པ་ བསམ་ མི་ ཁྱབ་པ་ སྦྱིན །_།
en: I will give inconceivable gifts.

source: གཅིག་པུ ས་ སྤྱད་པ ར་ མི་ བྱ་ སྟེ །_།
en: Not enjoying awakening alone,

source: བདག་ གིས་ སྲོག་ཆགས་ བྱེ་བ་ སྦྱིན །_།
en: I will give it to ten million beings.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ་ ལ་ རྣམ་པར་ གཟིགས་ ཏེ །_
en: $1673 The Blessed One then glanced at the child Vijayarakṣa.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ རྣམ་པར་ གཟིགས་ མ་ ཐག་ ཏུ་ ཡང་ དེ་ནས་ དེ་ཉིད་ ཀྱི་ ཚེ་ གོས་ ངུར་སྨྲིག་ གྱོན་ ཞིང་ འདུག་པ ར་ གྱུར་ ཏེ །_
en: No sooner had he looked at him than the boy was clad in ochre robes, sat down, and

source: སྐྲ་ བྲེགས་ ནས་ ཞག་ བདུན་ ལོན་པ་ ལྟ་བུ ར་ ཡང་ གྱུར་ ཏོ །_།
en: it seemed as if his hair had been shaved for seven days.

source: སྐད་ཅིག་ དེ་ཉིད་ ལ་ མངོན་པར་ ཤེས་པ་ ལྔ་ ཡང་ ཐོབ་བོ །_།
en: At that very moment he attained the five superknowledges.

source: དེ་ནས་ གཞོན་ནུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ ས་ ཕྱོགས་ དེ་ཉིད་ དུ་ འདུག་ ནས་ མི་སྣང་བ ར་ གྱུར་ ཏེ །_
en: Then, while seated on that very spot, the boy Vijayarakṣa vanished.

source: དེ་ མི་སྣང་བ ར་ གྱུར་ མ་ ཐག་ ཏུ་ ས་ ཆེན་པོ་ ཡང་ གཡོས་ ཤིང་ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ་ དང་ བཅས་པ འི་ སྐྲག་པ ར་ ཡང་ གྱུར །_
en: As soon as he vanished, the earth quaked, and everyone felt tingling waves of trepidation.

source: ལྷ་ དག་ ཀྱང་ སྟེང་ གི་ བར་སྣང་ ལས་ རྔ་ རྡུང་ ཞིང་ལྷ འི་ གླུ་དབྱངས་ ལེན་པ ར་ ཡང་ གྱུར །_
en: Gods appeared from the sky, playing drums and singing divine melodies, and

source: འཇིག་རྟེན་ དུ་ སྣང་བ་ ཆེན་པོ་ བྱུང་བ ར་ གྱུར་ ཏོ །_།
en: the earth was flooded with a bright light.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ འི་ ཚེ་ འཛུམ་པ་ མཛད་ དོ །_།
en: $1674 At that moment the Blessed One smiled.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞལ་ གྱི་ སྒོ་ ནས་ འོད་ཟེར་ ཁ་དོག་ དུ་མ་ ཁ་དོག་ སྣ་ཚོགས་ སུ་ བྱུང་ སྟེ །_ |#| བྱུང་ [199a] ནས་ ཀྱང་ ཐམས་ཅད་ དང་ ལྡན་པ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ལ་ ལན་ གསུམ་ བསྐོར་བ་ བྱས་ ནས་ |#| སྤྱི་གཙུག་ གི་ མཚམས་ སུ་ ནུབ་བོ །_།
en: From the Blessed One’s mouth streamed light rays of many different colors, [199.a] which circled the entire buddha realm three times before dissolving back into his crown protuberance.

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ ཀུན་དགའ་བོ་ སྟན་ ལས་ ལངས་ ནས་ |#| བླ་གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ཏེ |#| པུས་མོ་ གཡས་པ འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ ཞུས་པ །_
en: $1675 The venerable Ānanda then rose from his seat, draped his robe over one shoulder, knelt on his right knee, and said to the Blessed One in verse:

source: མི་ འདུལ་ ཁ་ལོ་ སྒྱུར་བ་ སེམས་ཅན་ མཆོག _། སྤྱོད་པ་ ཡོན་ཏན་ ཁྱད་པར་ འཕགས་ ལ་ གནས །_།
en: $1676 “Tamer of men, leader, best of beings, |#| You who abide by conduct with exalted qualities,

source: རྒྱལ་བ་ ཡེ་ཤེས་ མ་ ཆགས་ ཕ་རོལ་ གཤེགས །_། |#| ཀུན་མཁྱེན་ རྒྱལ་བ་ བླ་ ན་ མེད་ ལ་ ཞུ །_།
en: Victor who has perfected wisdom and non-attachment, Omniscient one, unexcelled victor, I ask you:

source: ཞལ་ ནས་ འོད་ཟེར་ མང་པོ་ བྱུང་ ནས་ སུ །_། འོད་ ཀྱིས་ སངས་རྒྱས་ ཞིང་ ནི་ ཐམས་ཅད་ ཁྱབ །_།
en: $1677 “Many light rays streamed from your mouth, Pervading the entire buddha realm with their light.

source: སངས་རྒྱས་ ཞིང་ དེ་ ལ་ ནི་ བསྐོར་ བགྱིས་ ནས །_།
en: After circling the buddha realm,

source: དེ་དག་ སླར་ ལོག་ ནས་ ཀྱང་ སྤྱི་གཙུག་ ནུབ །_།
en: They returned and dissolved back into your crown protuberance.

source: རྒྱུ་མ་ མཆིས་པ ར་ སངས་རྒྱས་ འཛུམ་ མི་ སྟོན །_།
en: $1678 “The Buddha does not smile without a reason.

source: དེ་རིང་ སུ་ ཡི་ དོན་ སླད་ འཛུམ་ དེ་ བསྟན །_།
en: For whose sake did you smile today?

source: ལུང་བསྟན་ དེ་ ནི་ སུ་ ཡི་ ལགས་ པར་ འགྱུར །_།
en: To whom will that prediction apply?

source: འཇིག་རྟེན་ མགོན་པོ་ བདག་ གི་ ཐེ་ཚོམ་ ཆོད །_།
en: Resolve my uncertainty, savior of the world!

source: གང་ གིས་ འཛུམ་པ་ དེ་ འདྲ་ བསྟན་ གྱུར་ ཅིང་ །_། སངས་རྒྱས་ ཞིང་ དེ་ ཐམས་ཅད་ སྣང་ བགྱིས་པ འི །_། ཡངས་པ འི་ དོན་ དེ་ སུ་ ཡི་ ལགས་ པར་ འགྱུར །_།
en: $1679 “Who caused you to show such a smile, And illuminate the entire buddha realm? |#| To whom does that great significance apply?

source: ཡེ་ཤེས་ མཆོག་ གིས་ འདིར་ ནི་ སུ་ ལུང་ སྟོན །_།
en: With your supreme wisdom, whom do you predict?

source: སངས་ རྒྱས་ ཞིང་ བརྒྱན་པ་ ནི་ མཛེས་པ་ ལགས །_།
en: $1680 “The adornment of the buddha realms was exquisite, And

source: སེམས་ཅན་ ཀུན་ ཀྱང་ བདེ་བ ར་ གྱུར་པ་ ལགས །_།
en: all beings too were gladdened.

source: འདི་ ལ་ བག་མ་ མཆིས་པ ར་ སེམས་ མི་ འཇུག _། |#| ཆོ་འཕྲུལ་ དེ་ལྟ་ བུ་ ནི་ གདའ་ ལགས་སོ །_།
en: We do not consider this to be haphazard, Such a miraculous feat as it was.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ ཀུན་དགའ་བོ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $1681 The Blessed One asked Ānanda,

source: ཀུན་དགའ་བོ་ ཁྱོད་ ཀྱིས་ ས་ཕྱོགས་ འདི་ཉིད་ ན་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ་ གོས་ ངུར་སྨྲིག་ གྱོན་པ་ མཐོང་ ངམ །_
en: “Ānanda, did you see on this very spot the child Vijayarakṣa wearing ochre?”

source: བཅོམ་ལྡན་འདས་ མཐོང་ ལགས་སོ །_།
en: “Yes, Blessed One, I did,”

source: ཀུན་དགའ་བོ་ ཁྱེའུ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ་ དེ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ མི་ འཁྲུགས་པ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་པར་ དགའ་བ ར་ ལུས་ དེ་ཉིད་ ཀྱིས་ འདུག་ གོ །_།
en: $1682 “Ānanda,” |#| “that child Vijayarakṣa is sitting with that very same body in the world system of Abhirati, the buddha realm of the thus-gone one Akṣobhya.

source: དེ འི་ ཚེ་ ཇི་སྲིད་ པར་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེར་ ཚངས་པ ར་ སྤྱོད་པ་ སྤྱད་ ནས་ ལུས་ དེ་ཉིད་ ཀྱིས་ རྒྱལ་སྲིད་ ཐོབ་ སྟེ །_
en: Having practiced pure conduct in that buddha realm for his entire life, he will acquire dominion with that very body,

source: འདི་ལྟ་སྟེ །_ དཔེར་ན་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱིས་ ད་ལྟ ར་ [199b] རྒྱལ་སྲིད་ ཐོབ་པ་ བཞིན་ ནོ །_།
en: just as Śakra, lord of the gods, has acquired dominion now. [199.b]

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ ཤི་འཕོས་ ནས་ ཀྱང་
en: Even after he dies and departs from that buddha realm,

source: ལུས་ དེ་ཉིད་ ཀྱིས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དུ་ འགྲོ་བ ར་ འགྱུར་ ཞིང་ ནམ་ དུ་ ཡང་ སངས་རྒྱས་ དང་ འབྲལ་བ ར་ མི་ འགྱུར་ ལ །_
en: he will travel from buddha realm to buddha realm with that same body, never parting from the buddhas.

source: ཐམས་ཅད་ དུ་ ལུས་ ཐོབ་པ་ དེས་ ཀྱང་ རྒྱལ་སྲིད་ ཐོབ་པ ར་ འགྱུར་ རོ །_།
en: Wherever he goes with that body he has obtained, he will acquire dominion.

source: དེ་ ཕྱིས་ ཀྱང་ བསྐལ་པ་ གྲངས་མེད་པ་ ན་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ ཏེ །_། |#| འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ སྣང་བར་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཡེ་ཤེས་ མཐའ་ ཡ ས་ རྣམ་པར་ བསགས་ ཞེས་ བྱ་བ ར་ འགྱུར་ རོ །_།
en: Then, after a countless eon he will fully awaken to unexcelled and perfect buddhahood, becoming the thus-gone one, the worthy one, the perfect buddha who perpetually illuminates the world systems called Anantajñānavicita.

source: ཀུན་དགའ་བོ་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཆེན་པོ་ རྣམ་པར་ བསགས་པ འི་ ཚེ འི་ ཚད་ ནི་ དཔག་ ཏུ་ མེད་པར་ འགྱུར་ ཏེ །_ |#| བསྐལ་པ་ འདི་ སྙེད་ དོ་ ཞེས་ དཔག་པ འམ །_ བགྲང་བ འམ །_ བསམ་པ ར་ མི་ ནུས་ སོ །_།
en: Ānanda, the lifespan of the thus-gone one Anantajñānavicita will be immeasurable, such that its precise number of eons will not be possible to measure, calculate, or imagine.

source: དེ་བཞིན་ གཤེགས་པ་ དེ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ གནས་པ འི་ སེམས་ཅན་ དེ་དག་ ནི་ མངལ་ དུ་ སྐྱེ་བ ར་ མི་ འགྱུར་ ཏེ །_
en: The beings who dwell in that thus-gone one’s buddha realm will not be born from a womb. |#| Rather,

source: སེམས་ཅན་ དེ་དག་ རྫུས་ ཏེ་ སྐྱེ་བ ར་ འགྱུར་ ཞིང་ །_ པད་མ་ དག་ གི་ སྟེང་ དུ་ སྐྱིལ་མོ་ཀྲུང་ གིས་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: they will be miraculously born, appearing cross-legged upon lotuses.

source: ཀུན་དགའ་བོ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ནི་ ཡོན་ཏན་ ཁྱད་པར་ཅན་ དཔག་ ཏུ་ མེད་ པ་ གཞན་དག་ གིས་ ཀྱང་ ལེགས་པ ར་ བརྒྱན་པ ར་ འགྱུར་ རོ །_།
en: Ānanda, that buddha realm will be adorned with other immeasurable, exalted qualities.

source: ཀུན་དགའ་བོ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ བཞི་ དང་ ལྡན་ ན་ ཚེ་ རྗེས་ ནས་ དགེ་སློང་ ཚུ ར་ ཤོག་ ཅེས་བྱ་བ འི་ རབ་ཏུ་ འབྱུང་བ་ འཐོབ་ སྟེ །_
en: $1683 “Ānanda, there are four qualities bodhisattvas may possess that will ensure that in their future lives too they will succeed in going forth, and will be told, ‘Monk, come join me!’

source: ཀུན་དགའ་བོ་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བདག་ཉིད་ ཀྱང་ རབ་ཏུ་ འབྱུང་བ་ ལ་ མངོན་པར་ ཆས་པ་ ཡིན་ ཞིང་ །_། གཞན་དག་ ཀྱང་ རབ་ཏུ་ འབྱུང་བ་ ཡང་དག་ པར་ འཛིན་ དུ་ འཇུག་པ ར་ བྱེད་ ལ །_ རྣམ་པ་ ཐམས་ཅད་ ཀྱིས་ ཀྱང་ རབ་ཏུ་ འབྱུང་བ་ རྟོན་པ ར་ བྱེད་ དེ
en: Ānanda, bodhisattvas, having gone forth themselves, should also cause others to go forth and lead them to rely on going forth in all of its aspects.

source: རབ་ཏུ་ བྱུང་ ནས་ ཀྱང་
en: Once they have gone forth,

source: ཆོས་ དང་ ལྡན་པ འི་ གཏམ་ གྱིས་ རངས་པ ར་ བྱེད་ ཅིང་ །_ ཡང་དག་ པར་ འཛིན་ དུ་ འཇུག་ ལ་ ཡང་ དག་ པར་ གཟེངས་ སྟོད་པ་ ཡིན་ ཏེ །_།
en: bodhisattvas should delight them with a Dharma discourse and encourage them to uphold it.
